#pragma once

#undef UNICODE
#undef _UNICODE
#define WIN32_LEAN_AND_MEAN
#include <Windows.h>
#include <WinSock2.h>
#include <MSWSock.h> // For the new RIO extension definitions
#include <ws2ipdef.h> // For the SOCKADDR_INET struct definition
#include <intrin.h>
#include <vector>
#include <deque>
#include "..\PacketDefs.h"

#define NET_PROTO_MAJOR_VERSION 1
#define NET_PROTO_MINOR_VERSION 0
#define NET_PROTO_UDP_PORT_D2H 3128
#define NET_PROTO_UDP_PORT_H2D (NET_PROTO_UDP_PORT_D2H + 1)

#define PROTO_MAGIC_BYTE 0xA5
#define MAX_PACKET_WIRE_MTU_BYTES 1500u // The 1500-byte default MTU does *not* include the size of the Ethernet packet header
#define MAX_PACKET_UDP_MTU_BYTES 1472u // This equates to exactly a 1500-byte wire MTU once you add in the IPv4 and UDP headers sizes
#define COMPLETION_QUEUE_SIZE (32u * 1024u) // The maximum depth of the completion queue determines how many outstanding recv or send operations may be in flight at any one time

// This was calculated from an approximate average of how many min-size packets could be sent from a PC within 3 round trips on a low-latency LAN at gigabit ethernet speeds
#ifdef _DEBUG
	//#define MAX_UNACKED_PACKETS_RESEND_WINDOW 4u // Use a smaller number for testing
	#define MAX_UNACKED_PACKETS_RESEND_WINDOW 1u // Use a smaller number for testing
#else
	#define MAX_UNACKED_PACKETS_RESEND_WINDOW 64u // It's calcuated that we can send at least 82 max-size packets per millisecond using gigabit ethernet
#endif
//#define MAX_UNACKED_SENT_PACKETS_WINDOW_SIZE 1024u
// #define MAX_UNACKED_SENT_PACKETS_WINDOW_SIZE 1u // For now, let's simplify things by only handling a single unacked packet at a time (this is exactly how the D2H send channel works)
#define MAX_UNACKED_SENT_PACKETS_WINDOW_SIZE MAX_UNACKED_PACKETS_RESEND_WINDOW // Full blast!
#define FULL_PACKET_TOTAL_SIZE_BYTES 1500u // This includes the sizes of the packet header, UDP header, and IPv4 header

// Defines the number of entries in the rolling average window for calculating roundtrip packet latencies
#define LATENCY_ROLLING_TIMESTAMPS_WINDOW 10u

// Defines the number of entries in the rolling average window for calculating packet batch window sizes
#define PACKET_ACKS_ROLLING_AVERAGE_WINDOW 16u

// This define will increase the system's timer frequency up from the default of 16ms to 1ms which may improve latency significantly
#define INCREASE_TIMER_FREQUENCY 1

// When this version flag is detected, that means that the device is being software emulated rather than being run on real hardware
static const unsigned char VERSION_FLAG_SOFTWARE_EMULATION = 0x80;

typedef void gpuvoid;

typedef DWORD ThreadID;

#pragma pack(push)
#pragma pack(1)

struct EthernetHeader
{
	unsigned char preamble[7] = { 0x55, 0x55, 0x55, 0x55, 0x55, 0x55, 0x55 }; // Should always be 0x55
	unsigned char SFD = 0xD5; // Should always be 0xD5
	unsigned char destMAC[6]; // Destination MAC address
	unsigned char srcMAC[6]; // Source MAC address
	unsigned short etherType;

	// Ethernet payload goes here!
	// unsigned char payload[1500];

	unsigned long FCS_CRC32; // Finally the Ethernet frame ends with a 32-bit CRC for the entire packet data called the "Frame Check Sequence"

	// Following this Ethernet frame are at minimum 12 bytes of IPG (inter-packet gap)
};
static_assert(sizeof(EthernetHeader) == 26, "Error: Unexpected struct padding!");

struct IPv4Header
{
	unsigned char version : 4; // This is always equal to 4 for IPv4
	unsigned char IHL : 4; // This should always equal 5. It defines the length of the IPv4 header in DWORD's and our default/expected header size is 5*4=20
	unsigned char DSCP : 6;
	unsigned char ECN : 2;
	unsigned short totalLength; // The total length of the IPv4 packet including the packet header, in bytes (so the minimum length here is 20).
	unsigned short packetID;
	unsigned short flags_RESERVED_ZERO : 1; // This first packet flag bit is reserved and must always be set to 0
	unsigned short flags_DF : 1; // This is the "Don't Fragment" bit, which marks a packet as not being allowed to be fragmented.
	unsigned short flags_MF : 1; // This is the "More Fragments" bit which denotes that there are more packet fragments following this one (is 0 for the last packet fragment, also is 0 for regular unfragmented packets).
	unsigned short frag_offset : 13;
	signed char TTL; // Time to live counts down with each router hop and when it reaches 0, the packet may be discarded. It's used for preventing infinite packet loops.
	unsigned char protocolID; // Which IP protocol this is. Commonly used entries include IPPROTO_TCP and IPPROTO_UDP.
	unsigned short headerChecksum; // The IPv4 checksum only includes the IPv4 header and ignores the payload data
	unsigned long sourceIPv4Address;
	unsigned long destIPv4Address;
};
static_assert(sizeof(IPv4Header) == 20, "Error: Unexpected struct padding!");

struct UDPHeader
{
	unsigned short sourcePort;
	unsigned short destPort;
	unsigned short totalLength; // The total packet length including the UDP header and its contained data, in bytes. The minimum size is 8 bytes for a packet with just a header and no data.
	unsigned short UDPchecksum; // The TCP and UDP checksums are the exact same algorithm as the IPv4 checksum algorithm, except they also include an IPv4 pseudoheader in their checksum calculation.
};
static_assert(sizeof(UDPHeader) == 8, "Error: Unexpected struct padding!");

static_assert(MAX_PACKET_UDP_MTU_BYTES + sizeof(UDPHeader) + sizeof(IPv4Header) == MAX_PACKET_WIRE_MTU_BYTES, "Error: Unexpected MTU sizes!");

struct PacketBuffer
{
	unsigned __int64 originalSendTime; // The QueryPerformanceCounter() timestamp of when this packet was originally first sent and added into the unacked packets queue
	USHORT packetNumber;
	USHORT packetLenBytes;
	bool hasPacketBeenSent; // Determines if this packet has yet been sent (and is thus a resend packet) or if it has not yet been sent. This field only has a meaning for H2D packets.

	BYTE packetBytes[1];
};
static_assert(sizeof(PacketBuffer) == 14, "Error: Unexpected struct padding!");

// All packets start with the same magic byte.
// It is how we verify that packets received are intended for our protocol and not some other one, and also how we ensure that the packet is not corrupted (at least the first byte isn't corrupted):
struct PacketHeaderMagic
{
	BYTE magicProtoValue = PROTO_MAGIC_BYTE;
	command::ePacketType packetType; // This defines which type of packet this is!
};
static_assert(sizeof(PacketHeaderMagic) == 2, "Error: Unexpected struct padding!");

struct DeviceBroadcastPacket : PacketHeaderMagic
{
	// PacketType is always "PT_CONNBROADCAST" (29 or 0x1D)
	
	// The version of the network protocol that the sending device uses to communicate.
	BYTE netProtoVersionMajorDevice; // The host and device may establish a session only if their MAJOR network protocol versions match.
	BYTE netProtoVersionMinorDevice; // The minor version of the network protocol is allowed to differ between the host and device.
	
	// Broadcast payload data follows:
	BYTE deviceMACAddress[6]; // The MAC address of the broadcasting device
	BYTE deviceIPv4Address[4]; // The IPv4 address of the broadcasting device
	USHORT numBroadcastsSinceReset; // The number of broadcasts that this device has emitted since power-on, or since the last host disconnected (wraps around to 0 on overflow)
	BYTE hasLostSession; // 0 if this device has just powered on, or 1 if this device has previously lost a session with a host.
};
static_assert(sizeof(DeviceBroadcastPacket) == 17, "Error: Unexpected struct padding!");

struct HostRequestConnectSessionPacket : PacketHeaderMagic
{
	// PacketType is always "PT_CONNREQUEST" (30 or 0x1E)
	
	// The version of the network protocol that the sending host uses to communicate.
	BYTE netProtoVersionMajorHost; // The host and device may establish a session only if their MAJOR network protocol versions match.
	BYTE netProtoVersionMinorHost; // The minor version of the network protocol is allowed to differ between the host and device.
	BYTE unusedPadding; // This byte is currently unused, and just pads the packet payload to 8 bytes
	
	BYTE hostIPv4Address[4]; // The IPv4 address of the connecting host. This is checked against the actual IPv4 address that the packet comes in on to make sure it matches.
};
static_assert(sizeof(HostRequestConnectSessionPacket) == 9, "Error: Unexpected struct padding!");

enum SessionConnectRequestReplyStatus : BYTE
{
	// Success! We have a new session!
	acceptNewSession = 0, // 0

	// Error status codes follow:
	errInvalidRequestLength, // 1 -- The length of the host's "request session connect" packet was not valid.
	errInvalidNetProtoMajorVer, // 2 -- The major net proto version doesn't match between the host and device.
	errInvalidPacketType, // 3 -- The only packet type allowed from a host before a session is established is the "request session connect" packet.
	errInvalidIPv4Addr, // 4 -- The host used an invalid IPv4 address (0x00000000 or 0xFFFFFFFF are both considered "invalid")
	errMismatchIPv4Addr, // 5 -- The IPv4 address that the host used doesn't match the IPv4 address of the sent packet.
	errInvalidMagic, // 6 -- The magic byte at the start of the packet is not valid.

	MAX_NUM_SESSION_CONNECT_RESPONSE_STATUS // This must always be last
};

const char* const sessionConnectRequestReplyStatusStrings[] =
{
	"acceptNewSession", // 0

	// Error status codes follow:
	"errInvalidRequestLength", // 1 -- The length of the host's "request session connect" packet was not valid.
	"errInvalidNetProtoMajorVer", // 2 -- The major net proto version doesn't match between the host and device.
	"errInvalidPacketType", // 3 -- The only packet type allowed from a host before a session is established is the "request session connect" packet.
	"errInvalidIPv4Addr", // 4 -- The host used an invalid IPv4 address (0x00000000 or 0xFFFFFFFF are both considered "invalid")
	"errMismatchIPv4Addr", // 5 -- The IPv4 address that the host used doesn't match the IPv4 address of the sent packet.
	"errInvalidMagic" // 6 -- The magic byte at the start of the packet is not valid.
};
static_assert(ARRAYSIZE(sessionConnectRequestReplyStatusStrings) == MAX_NUM_SESSION_CONNECT_RESPONSE_STATUS, "Error: String table mismatches enum!");

struct DeviceConnectSessionResponsePacket : PacketHeaderMagic
{
	// PacketType is always "PT_CONNRESPONSE" (31 or 0x1F)
	
	SessionConnectRequestReplyStatus status; // Status can be "0" which means that the session is accepted, or it can be a nonzero error code status value that explains why the session failed to be created.
};
static_assert(sizeof(DeviceConnectSessionResponsePacket) == 3, "Error: Unexpected struct padding!");

enum SessionDisconnectReason : BYTE
{
	errUserRequestedClose = 0, // User requested session close
	errShutdown, // The program is shutting down, so we're trying to close the session gracefully.
	errSessionError, // Session Error
	errWindowOverrun, // Send Window Overrun - too many packets sent without any acks received. Session gets closed rather than unbounded memory leak.
	errARPLost, // ARP Lost - packets can no longer be delivered due to the entry falling out of our ARP table
	errTimeout, // We haven't received a packet from the other end in too long of a time. It probably locked up or hung somehow, or the router inbetween us stopped responding.
	errOther, // Some other error has resulted in this disconnect

	MAX_NUM_SESSION_DISCONNECT_REASON // This must always be last
};

const char* const sessionDisconnectReasonStrings[] =
{
	"errUserRequestedClose", // User requested session close
	"errShutdown", // The program is shutting down, so we're trying to close the session gracefully.
	"errSessionError", // Session Error
	"errWindowOverrun", // Send Window Overrun - too many packets sent without any acks received. Session gets closed rather than unbounded memory leak.
	"errARPLost", // ARP Lost - packets can no longer be delivered due to the entry falling out of our ARP table
	"errTimeout", // We haven't received a packet from the other end in too long of a time. It probably locked up or hung somehow, or the router inbetween us stopped responding.
	"errOther" // Some other error has resulted in this disconnect
};
static_assert(ARRAYSIZE(sessionDisconnectReasonStrings) == MAX_NUM_SESSION_DISCONNECT_REASON, "Error: String table mismatches enum!");

struct SessionDisconnectPacket : PacketHeaderMagic
{
	// PacketType is always "PT_DISCONNECT" (33 or 0x21)

	BYTE senderIPv4Address[4];
	BYTE unusedPadding[2]; // Padding to ensure that the final packet size ends up being 8 bytes (ignoring the magic byte)
	SessionDisconnectReason disconnectReason;
};
static_assert(sizeof(SessionDisconnectPacket) == 9, "Error: Unexpected struct padding!");

struct Subpacket
{
	command::ePacketType subpacketType;
	DWORD payload0;
	DWORD payload1;
};
static_assert(sizeof(Subpacket) == 9, "Error: Unexpected struct padding!");

struct DeviceSessionPacket : PacketHeaderMagic
{
	// PacketType may be any packet type
	USHORT thisPacketID; // Packet ID of this current packet (drop packet if valid duplicates are detected)
	USHORT lastAckedPacketID; // Packet ID that the sender has last received
	BYTE packetChecksum; // Checksum for the header to ensure it's valid. This checksum only validates that the header is intact, it does not checksum all of the subpackets too.
	BYTE packetFlags; // Currently only bit 0 is used
	BYTE subpacketCount; // Number of subpackets included in this packet (valid for this to be 0 in the case of an ACK-only packet with no data). May go up to 1472/sizeof(SimplifiedCommandListPacket) = 163.

	static constexpr unsigned MIN_SUBPACKET_COUNT = 0u; // It *is* valid to send a session packet with 0 subpackets (this is typically only done in the case of heartbeat keepalives, or ack-only packets).
